test_reports/performance_profiling_nodeprofiler/output11.txt
This is ApacheBench, Version 2.3 <$Revision: 1874286 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/roles/create
Document Length:        27 bytes

Concurrency Level:      20
Time taken for tests:   0.186 seconds
Complete requests:      250
Failed requests:        0
Non-2xx responses:      250
Keep-Alive requests:    250
Total transferred:      89750 bytes
HTML transferred:       6750 bytes
Requests per second:    1344.52 [#/sec] (mean)
Time per request:       14.875 [ms] (mean)
Time per request:       0.744 [ms] (mean, across all concurrent requests)
Transfer rate:          471.37 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     4   14   4.4     13      27
Waiting:        2   14   4.4     13      27
Total:          4   14   4.3     13      27

Percentage of the requests served within a certain time (ms)
  50%     13
  66%     14
  75%     15
  80%     17
  90%     20
  95%     26
  98%     27
  99%     27
 100%     27 (longest request)