test_reports/performance_profiling_nodeprofiler/output12.txt
This is ApacheBench, Version 2.3 <$Revision: 1874286 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/itemsets/list
Document Length:        38 bytes

Concurrency Level:      20
Time taken for tests:   0.228 seconds
Complete requests:      250
Failed requests:        0
Non-2xx responses:      250
Keep-Alive requests:    250
Total transferred:      92500 bytes
HTML transferred:       9500 bytes
Requests per second:    1097.22 [#/sec] (mean)
Time per request:       18.228 [ms] (mean)
Time per request:       0.911 [ms] (mean, across all concurrent requests)
Transfer rate:          396.46 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     3   17   8.5     15      44
Waiting:        1   17   8.5     14      44
Total:          3   17   8.5     15      44

Percentage of the requests served within a certain time (ms)
  50%     15
  66%     18
  75%     20
  80%     22
  90%     31
  95%     40
  98%     44
  99%     44
 100%     44 (longest request)