test_reports/performance_profiling_nodeprofiler/output15.txt
This is ApacheBench, Version 2.3 <$Revision: 1874286 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/items/transfer
Document Length:        27 bytes

Concurrency Level:      20
Time taken for tests:   0.174 seconds
Complete requests:      250
Failed requests:        0
Non-2xx responses:      250
Keep-Alive requests:    250
Total transferred:      89750 bytes
HTML transferred:       6750 bytes
Requests per second:    1437.61 [#/sec] (mean)
Time per request:       13.912 [ms] (mean)
Time per request:       0.696 [ms] (mean, across all concurrent requests)
Transfer rate:          504.01 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     3   13   5.1     12      35
Waiting:        2   13   5.1     11      35
Total:          3   13   5.1     12      35

Percentage of the requests served within a certain time (ms)
  50%     12
  66%     12
  75%     14
  80%     14
  90%     20
  95%     27
  98%     29
  99%     30
 100%     35 (longest request)