test_reports/performance_profiling_nodeprofiler/output16.txt
This is ApacheBench, Version 2.3 <$Revision: 1874286 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/items/47c24ece-0dd5-48b0-866d-f8abbb73a2ba
Document Length:        27 bytes

Concurrency Level:      20
Time taken for tests:   0.181 seconds
Complete requests:      250
Failed requests:        0
Non-2xx responses:      250
Keep-Alive requests:    250
Total transferred:      89750 bytes
HTML transferred:       6750 bytes
Requests per second:    1382.02 [#/sec] (mean)
Time per request:       14.472 [ms] (mean)
Time per request:       0.724 [ms] (mean, across all concurrent requests)
Transfer rate:          484.52 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     3   14   5.0     12      38
Waiting:        1   14   5.0     12      38
Total:          3   14   5.0     12      38

Percentage of the requests served within a certain time (ms)
  50%     12
  66%     14
  75%     18
  80%     20
  90%     20
  95%     21
  98%     21
  99%     37
 100%     38 (longest request)