test_reports/performance_profiling_nodeprofiler/output17.txt
This is ApacheBench, Version 2.3 <$Revision: 1874286 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/users/list
Document Length:        38 bytes

Concurrency Level:      20
Time taken for tests:   0.157 seconds
Complete requests:      250
Failed requests:        0
Non-2xx responses:      250
Keep-Alive requests:    250
Total transferred:      92500 bytes
HTML transferred:       9500 bytes
Requests per second:    1593.28 [#/sec] (mean)
Time per request:       12.553 [ms] (mean)
Time per request:       0.628 [ms] (mean, across all concurrent requests)
Transfer rate:          575.70 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     3   12   2.5     12      18
Waiting:        1   12   2.6     12      18
Total:          3   12   2.5     12      18

Percentage of the requests served within a certain time (ms)
  50%     12
  66%     13
  75%     13
  80%     14
  90%     14
  95%     15
  98%     16
  99%     17
 100%     18 (longest request)