test_reports/performance_profiling_nodeprofiler/output22.txt
This is ApacheBench, Version 2.3 <$Revision: 1874286 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/requestitems/review
Document Length:        57 bytes

Concurrency Level:      20
Time taken for tests:   0.130 seconds
Complete requests:      250
Failed requests:        0
Non-2xx responses:      250
Keep-Alive requests:    250
Total transferred:      97000 bytes
HTML transferred:       14250 bytes
Requests per second:    1924.02 [#/sec] (mean)
Time per request:       10.395 [ms] (mean)
Time per request:       0.520 [ms] (mean, across all concurrent requests)
Transfer rate:          729.02 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     2   10   2.3     10      18
Waiting:        1   10   2.4     10      18
Total:          2   10   2.3     10      18

Percentage of the requests served within a certain time (ms)
  50%     10
  66%     10
  75%     11
  80%     11
  90%     12
  95%     13
  98%     14
  99%     18
 100%     18 (longest request)