test_reports/performance_profiling_nodeprofiler/output24.txt
This is ApacheBench, Version 2.3 <$Revision: 1874286 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/requestitems/lab/list/1f9c67f8-7b89-4392-b616-79f5e0257cfd
Document Length:        38 bytes

Concurrency Level:      20
Time taken for tests:   0.147 seconds
Complete requests:      250
Failed requests:        0
Non-2xx responses:      250
Keep-Alive requests:    250
Total transferred:      92500 bytes
HTML transferred:       9500 bytes
Requests per second:    1701.65 [#/sec] (mean)
Time per request:       11.753 [ms] (mean)
Time per request:       0.588 [ms] (mean, across all concurrent requests)
Transfer rate:          614.85 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     4   11   2.3     11      27
Waiting:        1   11   2.4     11      27
Total:          4   11   2.4     11      28

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     11
  75%     12
  80%     12
  90%     12
  95%     14
  98%     16
  99%     17
 100%     28 (longest request)