test_reports/performance_profiling_nodeprofiler/output25.txt
This is ApacheBench, Version 2.3 <$Revision: 1874286 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/requestitems/lend
Document Length:        57 bytes

Concurrency Level:      20
Time taken for tests:   0.156 seconds
Complete requests:      250
Failed requests:        0
Non-2xx responses:      250
Keep-Alive requests:    250
Total transferred:      97000 bytes
HTML transferred:       14250 bytes
Requests per second:    1603.49 [#/sec] (mean)
Time per request:       12.473 [ms] (mean)
Time per request:       0.624 [ms] (mean, across all concurrent requests)
Transfer rate:          607.57 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     3   12   2.9     12      21
Waiting:        1   12   2.9     12      21
Total:          3   12   2.9     12      21

Percentage of the requests served within a certain time (ms)
  50%     12
  66%     13
  75%     13
  80%     14
  90%     14
  95%     16
  98%     20
  99%     21
 100%     21 (longest request)