test_reports/performance_profiling_nodeprofiler/output26.txt
This is ApacheBench, Version 2.3 <$Revision: 1874286 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/requestitems/return
Document Length:        57 bytes

Concurrency Level:      20
Time taken for tests:   0.158 seconds
Complete requests:      250
Failed requests:        0
Non-2xx responses:      250
Keep-Alive requests:    250
Total transferred:      97000 bytes
HTML transferred:       14250 bytes
Requests per second:    1583.21 [#/sec] (mean)
Time per request:       12.633 [ms] (mean)
Time per request:       0.632 [ms] (mean, across all concurrent requests)
Transfer rate:          599.89 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     4   12   3.6     11      25
Waiting:        1   12   3.6     11      24
Total:          4   12   3.6     11      25

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     12
  75%     13
  80%     14
  90%     17
  95%     19
  98%     22
  99%     24
 100%     25 (longest request)