test_reports/performance_profiling_nodeprofiler/output4.txt
This is ApacheBench, Version 2.3 <$Revision: 1874286 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/registrar/roles
Document Length:        38 bytes

Concurrency Level:      20
Time taken for tests:   0.151 seconds
Complete requests:      250
Failed requests:        0
Non-2xx responses:      250
Keep-Alive requests:    250
Total transferred:      92500 bytes
HTML transferred:       9500 bytes
Requests per second:    1656.81 [#/sec] (mean)
Time per request:       12.071 [ms] (mean)
Time per request:       0.604 [ms] (mean, across all concurrent requests)
Transfer rate:          598.65 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     3   11   1.8     11      14
Waiting:        3   11   1.8     11      14
Total:          3   11   1.8     11      14

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     12
  75%     12
  80%     13
  90%     13
  95%     14
  98%     14
  99%     14
 100%     14 (longest request)