test_reports/performance_profiling_nodeprofiler/output6.txt
This is ApacheBench, Version 2.3 <$Revision: 1874286 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/labs
Document Length:        33 bytes

Concurrency Level:      20
Time taken for tests:   0.191 seconds
Complete requests:      250
Failed requests:        0
Non-2xx responses:      250
Keep-Alive requests:    250
Total transferred:      90500 bytes
HTML transferred:       8250 bytes
Requests per second:    1309.63 [#/sec] (mean)
Time per request:       15.272 [ms] (mean)
Time per request:       0.764 [ms] (mean, across all concurrent requests)
Transfer rate:          462.97 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     4   14   4.3     12      32
Waiting:        4   14   4.3     12      32
Total:          4   14   4.3     12      32

Percentage of the requests served within a certain time (ms)
  50%     12
  66%     14
  75%     15
  80%     17
  90%     21
  95%     23
  98%     24
  99%     25
 100%     32 (longest request)